{"Vietnam National University, Hanoi": ["1", "19 P. Lê Thánh Tông, Phan Chu Trinh, Hoàn Kiếm, Hà Nội, Vietnam"], "HUTECH University": ["10", "475A Điện Biên Phủ, Phường 25, Bình Thạnh, Thành phố Hồ Chí Minh, Vietnam"], "VNUHCM - University of Science": ["11", "227 Đ. Nguyễn Văn Cừ, Phường 4, Quận 5, Thành phố Hồ Chí Minh, Vietnam"], "Vietnam National University, Ho Chi Minh City": ["12", "Đ. Võ Trường Toản, Phường Linh Trung, TP Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Hue University": ["13", "Huế, Thua Thien Hue, Vietnam"], "University of Economics and Law": ["14", "669 QL1A, khu phố 3, Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Ho Chi Minh City University of Information Technology": ["15", "Đường Hàn Thuyên, khu phố 6 P, Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Foreign Trade University": ["16", "91 Chùa Láng, Láng Thượng, Đống Đa, Hà Nội, Vietnam"], "Thuyloi University": ["17", "175 P. Tây Sơn, Trung Liệt, Đống Đa, Hà Nội 116705, Vietnam"], "Ho Chi Minh City University of Technology and Education": ["18", "1 Đ. Võ Văn Ngân, Linh Chiểu, Thành Phố Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Hanoi National University of Education": ["19", "136 Xuân Thủy, Dịch Vọng Hậu, Cầu Giấy, Hà Nội 10000, Vietnam"], "Hanoi University of Science and Technology": ["2", "1 Đại Cồ Việt, Bách Khoa, Hai Bà Trưng, Hà Nội, Vietnam"], "Ho Chi Minh City University of Social Sciences and Humanities": ["20", "10-12 Đ. Đinh Tiên Hoàng, Bến Nghé, Quận 1, Thành phố Hồ Chí Minh, Vietnam"], "Hoa Sen University": ["21", "8 Nguyễn Văn Tráng, Phường Bến Thành, Quận 1, Thành phố Hồ Chí Minh 700000, Vietnam"], "Ho Chi Minh City University of Foreign Languages and Information Technology": ["22", "828 Sư Vạn Hạnh, Phường 12, Quận 10, Thành phố Hồ Chí Minh, Vietnam"], "Vietnam National University of Agriculture": ["23", "Viện Sinh học Nông nghiệp, Ngõ 86 Trâu Quỳ, Trâu Quỳ, Gia Lâm, Hà Nội, Vietnam"], "Ho Chi Minh City International University": ["24", "khu phố 6, TP Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Dalat University": ["25", "1 Đường Phù Đổng Thiên Vương, Phường 8, Thành phố Đà Lạt, Lâm Đồng, Vietnam"], "Hanoi University of Mining and Geology": ["26", "Số 18 Phố Viên, Đức Thắng, Bắc Từ Liêm, Hà Nội 100000, Vietnam"], "Nguyen Tat Thanh University": ["27", "300A Nguyễn Tất Thành, Phường 13, Quận 4, Thành phố Hồ Chí Minh 70000, Vietnam"], "Thai Nguyen University": ["28", "2 Ba Ling Bei Jie, Xing Hua Ling Qu, Tai Yuan Shi, Shan Xi Sheng, China, 030013"], "Nha Trang University": ["29", "Số 2 Nguyễn Đình Chiểu, Vĩnh Thọ, Nha Trang, Khánh Hòa 650000, Vietnam"], "University of Economics Ho Chi Minh City": ["3", "59C Nguyễn Đình Chiểu, Phường 6, Quận 3, Thành phố Hồ Chí Minh, Vietnam"], "University of Transport and Communications": ["30", "3 Đ. Cầu Giấy, Láng Thượng, Đống Đa, Hà Nội, Vietnam"], "Ho Chi Minh City University of Education": ["31", "Ho Chi Minh City, Vietnam"], "Ho Chi Minh City University of Law": ["32", "2 Nguyễn Tất Thành, Phường 13, Quận 4, Thành phố Hồ Chí Minh, Vietnam"], "Hanoi University": ["33", "Km 9 Đ. Nguyễn Trãi, P. Văn Quán, Từ Liêm, Hà Nội, Vietnam"], "The University of Medicine and Pharmacy at Ho Chi Minh City": ["34", "217 Hồng Bàng, Phường 11, Quận 5, Thành phố Hồ Chí Minh, Vietnam"], "Hong Duc University": ["35", "No address info"], "Lac Hong University": ["36", "Huỳnh Văn Nghệ, Bửu Long, Thành phố Biên Hòa, Đồng Nai, Vietnam"], "National University of Civil Engineering": ["37", "55 Giải Phóng, Đồng Tâm, Hai Bà Trưng, Hà Nội, Vietnam"], "Vinh University": ["38", "Ng, 1 Đ Lê Lợi, Hưng Bình, Tp. Vinh, Nghệ An, Vietnam"], "Baria Vungtau University": ["39", "80 Trương Công Định, Phường 3, Thành phố Vũng Tầu, Bà Rịa - Vũng Tàu, Vietnam"], "Can Tho University": ["4", "Khu II, Đ. 3/2, Xuân Khánh, Ninh Kiều, Cần Thơ, Vietnam"], "Van Lang University": ["40", "45 Nguyễn Khắc Nhu, Phường Cô Giang, Quận 1, Thành phố Hồ Chí Minh 700000, Vietnam"], "Hong Bang International University": ["41", "3 Hoàng Việt, Phường 4, Tân Bình, Thành phố Hồ Chí Minh, Vietnam"], "Hanoi Medical University": ["42", "1 P. Tôn Thất Tùng, Kim Liên, Đống Đa, Hà Nội 116001, Vietnam"], "Hanoi Architectural University": ["43", "Km10 Đ. Nguyễn Trãi, P. Văn Quán, Hà Đông, Hà Nội, Vietnam"], "Vietnam Maritime University": ["44", "484 Lạch Tray, Đổng Quốc Bình, Lê Chân, Hải Phòng, Vietnam"], "Hanoi Law University": ["45", "87 Đ. Nguyễn Chí Thanh, Thành Công, Đống Đa, Hà Nội, Vietnam"], "FPT University": ["46", "Đất Thổ Cư Hòa Lạc, Km29 Đường Cao Tốc 08, Thạch Hoà, Thạch Thất, Hà Nội 10000, Vietnam"], "Ho Chi Minh City University of Food Industry": ["47", "140 Lê Trọng Tấn, Tây Thạnh, Tân Phú, Thành phố Hồ Chí Minh, Vietnam"], "Saigon University": ["48", "273 An D. Vương, Phường 3, Quận 5, Thành phố Hồ Chí Minh 700000, Vietnam"], "Ho Chi Minh City University of Transport": ["49", "02 Võ Oanh, Phường 25, Bình Thạnh, Thành phố Hồ Chí Minh, Vietnam"], "The University of Da nang": ["5", "41 Đ. Lê Duẩn, Hải Châu 1, Hải Châu, Đà Nẵng 550000, Vietnam"], "Tay Bac University": ["50", "Chu Văn An, P. Quyết Tâm, Sơn La, Vietnam"], "Thuongmai University": ["51", "79 Đ. Hồ Tùng Mậu, Mai Dịch, Cầu Giấy, Hà Nội 122868, Vietnam"], "Dong Nai University of Technology": ["52", "5 Đ. Nguyễn Khuyến, Trảng Dài, Thành phố Biên Hòa, Đồng Nai, Vietnam"], "Hanoi University of Industry": ["53", "Số 298 Đ. Cầu Diễn, Minh Khai, Bắc Từ Liêm, Hà Nội, Vietnam"], "Thai Binh University of Medicine and Pharmacy": ["54", "Kỳ Bá, Thái Bình, Thai Binh, Vietnam"], "Quy Nhon University": ["55", "170 An Dương Vương, Nguyễn Văn Cừ, Thành phố Qui Nhơn, Bình Định, Vietnam"], "Hanoi University of Pharmacy": ["56", "13-15 P. Lê Thánh Tông, Phan Chu Trinh, Hoàn Kiếm, Hà Nội, Vietnam"], "VNU University of Science": ["57", "334 Đ. Nguyễn Trãi, Thanh Xuân Trung, Thanh Xuân, Hà Nội, Vietnam"], "Hanoi University of Business and Technology": ["58", "29A Ngõ 124 Phố Vĩnh Tuy, Thanh Long, Hai Bà Trưng, Hà Nội, Vietnam"], "Ho Chi Minh City University of Architecture": ["59", "196 Pasteur, Phường 6, Quận 3, Thành phố Hồ Chí Minh, Vietnam"], "Ho Chi Minh City University of Technology": ["6", "268 Lý Thường Kiệt, Phường 14, Quận 10, Thành phố Hồ Chí Minh, Vietnam"], "Hai Phong Medical University": ["60", "Haiphong, Hai Phong, Vietnam"], "Hanoi University of Culture": ["61", "418 Đ. La Thành, Chợ Dừa, Đống Đa, Hà Nội, Vietnam"], "Saigon International University": ["62", "8c Tống Hữu Định, Thảo Điền, Quận 2, Thành phố Hồ Chí Minh, Vietnam"], "Mientrung University of Civil Engineering": ["63", "No address info"], "Hung Vuong University": ["64", "Đ. Nguyễn Tất Thành, Nông Trang, Thành phố Việt Trì, Phú Thọ 29000, Vietnam"], "Phuong Dong University": ["65", "171 P. Trung Kính, Yên Hoà, Cầu Giấy, Hà Nội, Vietnam"], "Hanoi University of Industrial Fine Arts": ["66", "360 Đ. La Thành, Chợ Dừa, Đống Đa, Hà Nội, Vietnam"], "Bac Lieu University": ["67", "108 Võ Thị Sáu, Phường 8, Bạc Liêu, Vietnam"], "Hanoi Industrial Textile Garment University": ["68", "22Q6+2M4, Lệ Chi, Gia Lâm, Hanoi, Vietnam"], "Vo Truong Toan University": ["69", "QL1A, Tân Phú Thạnh, Châu Thành A, Hậu Giang, Vietnam"], "National Economics University": ["7", "207 Giải Phóng, Đồng Tâm, Hai Bà Trưng, Hà Nội, Vietnam"], "University of Technology & Management": ["70", "Nongshiliang, Nongrimbah, Shillong, Meghalaya 793014, India"], "Dong Do International University": ["71", "No address info"], "Eastern University of Technology": ["72", "Trincomalee Hwy, Chenkaladi, Sri Lanka"], "University of Hai Duong": ["73", "QL37, Liên Hồng, Gia Lộc, Hải Dương, Vietnam"], "Duy Tan University": ["8", "254 Nguyễn Văn Linh, Thạc Gián, Thanh Khê, Đà Nẵng 550000, Vietnam"], "Ho Chi Minh City University of Agriculture and Forestry": ["9", "VQCR+GP6, khu phố 6, Thủ Đức, Thành phố Hồ Chí Minh, Vietnam"], "Add University": ["Un", "No address info"]}